print('Напишите программу, которая считывает два целых числа A и B и выводит наибольшее значение из них')
print('Числа — целые от 1 до 1000.')
a = int(input())
b = int(input())
maxFigure = int((a + b + abs(a - b))/2)
print(maxFigure)
